Name: Adnan Shaikh<br>
Division: B<br>
Roll No: 28<br>
College: Keystone School of Engineering<br>

# Day 2:

In [68]:
import pandas as pd 

df = pd.read_csv("C:\AdnanData\projects\codingResources\datasets\student.csv")
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

# Slicing:<br>
- Use .iloc[rangeofrowstoslice, rowsofcolumnstoslice] to display only the rows and columns in the provided range, implicitly.<br>
- Use .iloc[[list of row indices], [list of columns indices]] to display the rows and columns specified explicitly.<br>
- Use .loc [indexofrowentry, [listofnameofcolumns]] to display attributes of the specified row indices. Use ':' as indexofrowentry to display all the entries.<br>
- Use .loc[[listofrowindices], [listofnameofcolumns]] to display specific multiple rows with specific multiple attributes.

In [69]:
slice = df.iloc [4:9, 1:4]
print(slice)

     name class  marks
4    asha    TE  63.28
5  ayesha    BE  49.55
6    amar    BE  65.34
7   amita    BE  68.33
8    amol    TE  56.75

In [70]:
slice = df.iloc[[2, 4, 6], [1, 4]]
slice

     name  age
2  aniket   19
4    asha   20
6    amar   19

In [71]:
slice = df.loc[:, ['name', 'marks']]
slice

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar  65.34
7    amita  68.33
8     amol  56.75
9    anmol  78.66

In [72]:
slice = df.loc[[1, 2, 3], ['name', 'marks']]
slice

      name  marks
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66

df['columname'] and df.columnname works the same way.

In [73]:
display(df['name'])
display(df.name)

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [74]:
df.iloc[list(range(3))+list(range(6, 10))]

   roll    name class  marks  age
0     1    anil    TE  56.77   22
1     2    amit    TE  59.77   21
2     3  aniket    BE  76.88   19
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

To drop a column we use df.drop() method. It takes two arguments, the index of the entry (row) or name of the attribute (column) and axis = 0/1. Use axis = 0 for dropping row and axis = 1 for dropping column. By default the value is axis=0.

In [75]:
df.drop('name', axis=1)

   roll class  marks  age
0     1    TE  56.77   22
1     2    TE  59.77   21
2     3    BE  76.88   19
3     4    TE  69.66   20
4     5    TE  63.28   20
5     6    BE  49.55   20
6     7    BE  65.34   19
7     8    BE  68.33   23
8     9    TE  56.75   20
9    10    BE  78.66   21

# Functions

In [76]:
df.age.mean()

20.5

In [77]:
df.age.min()

19

In [78]:
df.age.max()

23

In [79]:
df.age.sum()

205

In [80]:
df.name.sum()

'anilamitaniketajinkyaashaayeshaamaramitaamolanmol'

In [81]:
df.name.min()

'ajinkya'

In [82]:
df.name.max()

'ayesha'

In [83]:
df.age.median()

20.0

In [84]:
df.age.std()

1.2692955176439846

In [85]:
df.age.value_counts()

age
20    4
21    2
19    2
22    1
23    1
Name: count, dtype: int64

In [86]:
df.age.mode()

0    20
Name: age, dtype: int64

In [87]:
df.age.count()

10

for checking null values using isna() and then displaying the sum of null values in each attribute using sum():

In [88]:
df.isna().sum()

roll     0
name     0
class    0
marks    0
age      0
dtype: int64

In [89]:
#min of each attribute
df.min()

roll           1
name     ajinkya
class         BE
marks      49.55
age           19
dtype: object

In [90]:
#max of each attribute
df.max()

roll         10
name     ayesha
class        TE
marks     78.66
age          23
dtype: object

In [91]:
#mean of only numberic attributes
df.mean(numeric_only=True)

roll      5.500
marks    64.499
age      20.500
dtype: float64

In [92]:
#mean of all numeric values in each row
df.mean(numeric_only=True, axis = 1)

0    26.590000
1    27.590000
2    32.960000
3    31.220000
4    29.426667
5    25.183333
6    30.446667
7    33.110000
8    28.583333
9    36.553333
dtype: float64

In [93]:
#displays information of contents of the dataframe.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   roll    10 non-null     int64
 1   name    10 non-null     object
 2   class   10 non-null     object
 3   marks   10 non-null     float64
 4   age     10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 532.0+ bytes

In [94]:
#displays the various calculated measures of the dataframe.
df.describe()

           roll      marks        age
count  10.00000  10.000000  10.000000
mean    5.50000  64.499000  20.500000
std     3.02765   9.207179   1.269296
min     1.00000  49.550000  19.000000
25%     3.25000  57.520000  20.000000
50%     5.50000  64.310000  20.000000
75%     7.75000  69.327500  21.000000
max    10.00000  78.660000  23.000000